app/views/contents/edit.html.haml

%h1= t('application.editing', model:t('activerecord.modules.content.one'))
---
SELECT "contents".* FROM "contents" WHERE "contents"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]