app/views/contents/show.html.haml

SELECT "contents".* FROM "contents" WHERE "contents"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
%h1= t('activerecord.modules.content.one')