app/views/patients/index.html.haml

      %tr
        %th= t('activerecord.attributes.patient.first_name')
---
SELECT "patients".* FROM "patients"