app/views/patients/show.html.haml

SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
%b
  = t('activerecord.attributes.patient.first_name')