app/views/doctors/_form.html.haml

SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                  - if @doctor.first_name.blank?
                    = t('activerecord.errors.error_message_blank', model: t('activerecord.attributes.doctor.first_name'))