app/views/doctors/index.html.haml

      %tr
        %th= t('activerecord.attributes.doctor.first_name')
---
SELECT "doctors".* FROM "doctors"