app/views/doctors/show.html.haml

SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
%b
  = t('activerecord.attributes.doctor.first_name')