app/controllers/appointments_controller.rb

  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save
---
INSERT INTO "appointments" ("date", "doctor_id", "patient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["date", "2023-05-01 11:43:00"], ["doctor_id", 1], ["patient_id", 2], ["created_at", "2023-05-01 17:40:24.876106"], ["updated_at", "2023-05-01 17:40:24.876106"]]

    def set_doctors
      @doctors = Doctor.all.map {|doctor| ["#{doctor.first_name} #{doctor.last_name} - #{doctor.code}", doctor.id]}
---
SELECT "doctors".* FROM "doctors"

    def set_patients
      @patients = Patient.all.map {|patient| ["#{patient.first_name} #{patient.last_name}", patient.id]}
---
SELECT "patients".* FROM "patients"