app/controllers/contents_controller.rb

  def index
    @contents = Content.all
---
SELECT "contents".* FROM "contents" ORDER BY "contents"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def create
    @content = Content.new(content_params)

    respond_to do |format|
      if @content.save
---
INSERT INTO "contents" ("title", "description", "start_date", "end_date", "created_at", "updated_at", "special_type") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @content.destroy
---
DELETE FROM "contents" WHERE "contents"."id" = $1  [["id", 1]]

    def set_content
      @content = Content.find(params[:id])
---
SELECT "contents".* FROM "contents" WHERE "contents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]