app/controllers/doctors_controller.rb

  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save
---
INSERT INTO "doctors" ("first_name", "last_name", "code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "doctor3"], ["last_name", "doctor3"], ["code", "8965"], ["created_at", "2023-05-01 20:17:31.017147"], ["updated_at", "2023-05-01 20:17:31.017147"]]