app/views/appointments/_form.html.haml

SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  .form-group.mx-4
    = f.label t('activerecord.modules.doctor.one'), class: "form-label required"
    .div.w-25

SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  .form-group.mx-4
    = f.label t('activerecord.modules.patient.one'), class: "form-label required"
    .div.w-25