app/views/appointments/index.html.haml

          %td= appointment.date.strftime("%d/%m/%Y %I:%M %P")
          %td= appointment.doctor.first_name
          %td= appointment.patient.first_name
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]