app/views/appointments/show.html.haml

SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  = ':'
  = @appointment.doctor.first_name

SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  = ':'
  = @appointment.patient.first_name