app/views/appointments/show.html.haml

%h1= t('activerecord.modules.appointment.one')
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]